MassTransfer/Cases/He1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;
//startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         0.05;

deltaT          0.0001;
adjustTimeStep  no;
maxAlphaCo      1;

writeControl    adjustableRunTime;
writeInterval   0.0001;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

/*
libs
(
    "libgroovyBC.so"
);
*/

functions
{
}

// ************************************************************************* //
